docs/qc-kb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-01 Wed 14:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QC平台知识库</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Fu Yajun" />

<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">QC平台知识库</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfb1be42">1. Burn Image</a>
<ul>
<li><a href="#orgf3571af">1.1. Flash QRD</a></li>
<li><a href="#orgcf770e2">1.2. Update an Image part</a></li>
</ul>
</li>
<li><a href="#org68efb7b">2. Factory Test</a>
<ul>
<li><a href="#orgd4e621b">2.1. BT Config</a></li>
<li><a href="#org249d1f7">2.2. 工程模式下写入和读取BD  ADDR</a></li>
</ul>
</li>
<li><a href="#orgcec4ef7">3. 高通处理器规格表</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfb1be42" class="outline-2">
<h2 id="orgfb1be42"><span class="section-number-2">1</span> Burn Image</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf3571af" class="outline-3">
<h3 id="orgf3571af"><span class="section-number-3">1.1</span> Flash QRD</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Steps:
</p>
<div class="org-src-container">
<pre class="src src-sh">adb root
adb reboot-bootloader
pushd <span style="color: #2d9574;">\\</span>network_path
python fastboot_complete.py
<span style="color: #4f97d7;">[</span>Wait for fastboot build download finish<span style="color: #4f97d7;">]</span>
fastboot reboot
</pre>
</div>

<p>
download QCN:
</p>

<pre class="example">
adb shell setprop persist.radio.multisim.config ssss

</pre>

<p>
down完QCN以后，然后手机会reboot， 如果没识别的话，你就发这个命令下去 再reboot一下.
</p>
</div>
</div>

<div id="outline-container-orgcf770e2" class="outline-3">
<h3 id="orgcf770e2"><span class="section-number-3">1.2</span> Update an Image part</h3>
<div class="outline-text-3" id="text-1-2">
<p>
command format: <b>fastboot.exe flash bluetooth<sub>a</sub> abl.elf</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">part name(Android P)</th>
<th scope="col" class="org-left">file name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">abl<sub>a</sub></td>
<td class="org-left">abl.elf</td>
</tr>

<tr>
<td class="org-left">bluetooth<sub>a</sub></td>
<td class="org-left">BTFW.bin</td>
</tr>

<tr>
<td class="org-left">boot<sub>a</sub></td>
<td class="org-left">boot.img</td>
</tr>

<tr>
<td class="org-left">cmnlib64<sub>a</sub></td>
<td class="org-left">cmnlib64.mbn</td>
</tr>

<tr>
<td class="org-left">cmnlib<sub>a</sub></td>
<td class="org-left">cmnlib.mbn</td>
</tr>

<tr>
<td class="org-left">devcfg<sub>a</sub></td>
<td class="org-left">devcfg.mbn</td>
</tr>

<tr>
<td class="org-left">dsp<sub>a</sub></td>
<td class="org-left">dspso.bin</td>
</tr>

<tr>
<td class="org-left">hyp<sub>a</sub></td>
<td class="org-left">hyp.mbn</td>
</tr>

<tr>
<td class="org-left">keymaster<sub>a</sub></td>
<td class="org-left">km4.mbn</td>
</tr>

<tr>
<td class="org-left">logfs</td>
<td class="org-left">logfs<sub>ufs</sub><sub>8mb.bin</sub></td>
</tr>

<tr>
<td class="org-left">logfs</td>
<td class="org-left">logfs<sub>ufs</sub><sub>8mb.bin</sub></td>
</tr>

<tr>
<td class="org-left">mdtp<sub>a</sub></td>
<td class="org-left">mdtp.img</td>
</tr>

<tr>
<td class="org-left">modem<sub>a</sub></td>
<td class="org-left">NON-HLOS.bin</td>
</tr>

<tr>
<td class="org-left">pmic<sub>a</sub></td>
<td class="org-left">pmic.elf</td>
</tr>

<tr>
<td class="org-left">rpm<sub>a</sub></td>
<td class="org-left">rpm.mbn</td>
</tr>

<tr>
<td class="org-left">system<sub>a</sub></td>
<td class="org-left">system.img</td>
</tr>

<tr>
<td class="org-left">persist</td>
<td class="org-left">persist.img</td>
</tr>

<tr>
<td class="org-left">userdata</td>
<td class="org-left">userdata.img</td>
</tr>

<tr>
<td class="org-left">storsec</td>
<td class="org-left">storsec.mbn</td>
</tr>

<tr>
<td class="org-left">mdtpsecapp</td>
<td class="org-left">mdtpsecapp.mbn</td>
</tr>

<tr>
<td class="org-left">tz<sub>a</sub></td>
<td class="org-left">tz<sub>a.mbn</sub></td>
</tr>

<tr>
<td class="org-left">vendor<sub>a</sub></td>
<td class="org-left">vendor.img</td>
</tr>

<tr>
<td class="org-left">xbl<sub>a</sub></td>
<td class="org-left">xbl.elf</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org68efb7b" class="outline-2">
<h2 id="org68efb7b"><span class="section-number-2">2</span> Factory Test</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd4e621b" class="outline-3">
<h3 id="orgd4e621b"><span class="section-number-3">2.1</span> BT Config</h3>
<div class="outline-text-3" id="text-2-1">
<p>
For Android O, 先在UI上把BT关掉然后执行
</p>
<pre class="example">
wdsdaemon -su

</pre>

<p>
然后是btconfig。
</p>

<div class="org-src-container">
<pre class="src src-sh">adb root
adb shell setprop qcom.bluetooth.soc pronto
adb shell setprop ro.qualcomm.bt.hci_transport smd
wdsdaemon -su <span style="color: #4f97d7;">(</span>no need for Pronto<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
open another cmd window
</p>

<div class="org-src-container">
<pre class="src src-sh">btconfig /dev/smd3 rawcmd <span style="color: #a45bad;">0x03</span> <span style="color: #a45bad;">0x0003</span> <span style="color: #4f97d7;">(</span>HCI Reset<span style="color: #4f97d7;">)</span> 
btconfig /dev/smd3 rawcmd <span style="color: #a45bad;">0x06</span> <span style="color: #a45bad;">0x03</span> <span style="color: #4f97d7;">&#65288;</span>Enter Test Mode&#36827;&#20837;&#27979;&#35797;&#27169;&#24335;<span style="color: #4f97d7;">&#65289;</span> 
btconfig /dev/smd3 rawcmd <span style="color: #a45bad;">0x03</span> <span style="color: #a45bad;">0x05</span> <span style="color: #a45bad;">0x02</span> <span style="color: #a45bad;">0x00</span> <span style="color: #a45bad;">0x02</span> <span style="color: #4f97d7;">&#65288;</span>Auto Accept All Connections&#33258;&#21160;&#36830;&#25509;<span style="color: #4f97d7;">&#65289;</span> 
btconfig /dev/smd3 rawcmd <span style="color: #a45bad;">0x03</span> <span style="color: #a45bad;">0x1A</span> <span style="color: #a45bad;">0x03</span> <span style="color: #4f97d7;">&#65288;</span>Page Inquiry Scans&#25353;&#39029;&#25195;&#25551;<span style="color: #4f97d7;">&#65289;</span> 
btconfig /dev/smd3 rawcmd <span style="color: #a45bad;">0x03</span> <span style="color: #a45bad;">0x20</span> <span style="color: #a45bad;">0x00</span> <span style="color: #4f97d7;">&#65288;</span>Disable Authentication&#21462;&#28040;&#35748;&#35777;<span style="color: #4f97d7;">&#65289;</span> 
btconfig /dev/smd3 rawcmd <span style="color: #a45bad;">0x03</span> <span style="color: #a45bad;">0x22</span> <span style="color: #a45bad;">0x00</span> <span style="color: #4f97d7;">&#65288;</span>Disable Encryption&#21462;&#28040;&#21152;&#23494;<span style="color: #4f97d7;">&#65289;</span> 
</pre>
</div>
</div>
</div>

<div id="outline-container-org249d1f7" class="outline-3">
<h3 id="org249d1f7"><span class="section-number-3">2.2</span> 工程模式下写入和读取BD  ADDR</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Write BD ADDRR</span>
btconfig /dev/smd3 rawcmd <span style="color: #a45bad;">0x3f</span> <span style="color: #a45bad;">000b</span> <span style="color: #a45bad;">0x01</span> <span style="color: #a45bad;">0x02</span> <span style="color: #a45bad;">0x06</span> <span style="color: #a45bad;">0x00</span> <span style="color: #a45bad;">0x55</span> <span style="color: #a45bad;">0x77</span> <span style="color: #a45bad;">0x77</span> <span style="color: #a45bad;">0x88</span> <span style="color: #a45bad;">0x00</span>

SOC is WCN
Done intiailizing fd = /dev/smd3
RAW HCI command: ogf <span style="color: #a45bad;">0x3f</span> ocf <span style="color: #a45bad;">0xb</span>
Params: <span style="color: #a45bad;">0x1</span> <span style="color: #a45bad;">0x2</span> <span style="color: #a45bad;">0x6</span> <span style="color: #a45bad;">0x0</span> <span style="color: #a45bad;">0x55</span> <span style="color: #a45bad;">0x77</span> <span style="color: #a45bad;">0x77</span> <span style="color: #a45bad;">0x88</span> <span style="color: #a45bad;">0x0</span>
SEND -&gt; dump :&#160; <span style="color: #a45bad;">0b</span> fc <span style="color: #a45bad;">09</span> <span style="color: #a45bad;">01</span> <span style="color: #a45bad;">02</span> <span style="color: #a45bad;">06</span> <span style="color: #a45bad;">00</span> <span style="color: #a45bad;">55</span> <span style="color: #a45bad;">77</span> <span style="color: #a45bad;">77</span> <span style="color: #a45bad;">88</span> <span style="color: #a45bad;">00</span>
Other event received, Breaking
RECV &lt;- dump :&#160; ff <span style="color: #a45bad;">0a</span> <span style="color: #a45bad;">0b</span> <span style="color: #a45bad;">01</span> <span style="color: #a45bad;">02</span> <span style="color: #a45bad;">06</span> <span style="color: #a45bad;">00</span> <span style="color: #a45bad;">55</span> <span style="color: #a45bad;">77</span> <span style="color: #a45bad;">77</span> <span style="color: #a45bad;">88</span> <span style="color: #a45bad;">00</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Read BD ADDDR</span>
btconfig /dev/smd3 rawcmd <span style="color: #a45bad;">0x04</span> <span style="color: #a45bad;">0x0009</span>

SOC is WCN
Done intiailizing fd = /dev/smd3
RAW HCI command: ogf <span style="color: #a45bad;">0x4</span> ocf <span style="color: #a45bad;">0x9</span>
Params:
SEND -&gt; dump :&#160; <span style="color: #a45bad;">09</span> <span style="color: #a45bad;">10</span> <span style="color: #a45bad;">00</span>
Other event received, Breaking
RECV &lt;- dump :&#160; <span style="color: #a45bad;">0e</span> <span style="color: #a45bad;">0a</span> <span style="color: #a45bad;">01</span> <span style="color: #a45bad;">09</span> <span style="color: #a45bad;">10</span> <span style="color: #a45bad;">00</span> <span style="color: #a45bad;">00</span> <span style="color: #a45bad;">55</span> <span style="color: #a45bad;">77</span> <span style="color: #a45bad;">77</span> <span style="color: #a45bad;">88</span> <span style="color: #a45bad;">00</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcec4ef7" class="outline-2">
<h2 id="orgcec4ef7"><span class="section-number-2">3</span> 高通处理器规格表</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="http://www.mydrivers.com/zhuanti/tianti/01/index_gaotong.html">http://www.mydrivers.com/zhuanti/tianti/01/index_gaotong.html</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fu Yajun</p>
<p class="date">Created: 2018-08-01 Wed 14:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
